In [13]:
import pandas as pd
import numpy as np
df = pd.read_csv('../data/raw/sales_test.csv', low_memory=False)

In [14]:
df_1 = pd.read_csv('../data/raw/sales_train.csv', low_memory=False)

In [15]:
df_1.count()

id          30490
item_id     30490
dept_id     30490
cat_id      30490
store_id    30490
            ...
d_1537      30490
d_1538      30490
d_1539      30490
d_1540      30490
d_1541      30490
Length: 1547, dtype: int64

In [30]:
df_1.head()

,id,item_id,dept_id,cat_id,store_id,state_id,d_1,d_2,d_3,d_4,...,d_1532,d_1533,d_1534,d_1535,d_1536,d_1537,d_1538,d_1539,d_1540,d_1541
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,1,0,1,0,1,0,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,8,2,0,8,2,3,1,1,3,8
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,0,1,3,2,1,1,2,2,3

In [15]:
df_2 = pd.read_csv('../data/raw/items_weekly_sell_prices.csv', low_memory=False)

In [34]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6841121 entries, 0 to 6841120
Data columns (total 4 columns):
 #   Column      Dtype
---  ------      -----
 0   store_id    object
 1   item_id     object
 2   wm_yr_wk    int64
 3   sell_price  float64
dtypes: float64(1), int64(1), object(2)
memory usage: 208.8+ MB

In [105]:
df_2.head()

  store_id        item_id  wm_yr_wk  sell_price
0     CA_1  HOBBIES_1_001     11325        9.58
1     CA_1  HOBBIES_1_001     11326        9.58
2     CA_1  HOBBIES_1_001     11327        8.26
3     CA_1  HOBBIES_1_001     11328        8.26
4     CA_1  HOBBIES_1_001     11329        8.26

In [115]:
import pandas as pd

# Assuming df_2 is your DataFrame

# Group by 'store_id' and 'wm_yr_wk' and calculate the number of unique 'item_id'
result = df_2.groupby(['wm_yr_wk', 'store_id'])['item_id'].nunique().reset_index()

# You can then select one row for each combination, for example, the first row
one_row_per_combination = result.head(1)

# Print the result
print(one_row_per_combination)

   wm_yr_wk store_id  item_id
0     11101     CA_1     1204

In [108]:
unique_weekid_count = df_2['wm_yr_wk'].nunique()
print("Number of unique weeks:", unique_weekid_count)

Number of unique weeks: 282

In [111]:
import pandas as pd


# Group by 'store_id' and 'wm_yr_wk' and calculate the number of unique 'item_id'
result = df_2.groupby(['store_id', 'wm_yr_wk'])['item_id'].nunique().reset_index()

# You can then select one row for each combination, for example, the first row
one_row_per_combination = result.head(283)

# Print the result
print(one_row_per_combination)

    store_id  wm_yr_wk  item_id
0       CA_1     11101     1204
1       CA_1     11102     1312
2       CA_1     11103     1363
3       CA_1     11104     1395
4       CA_1     11105     1413
..       ...       ...      ...
278     CA_1     11618     3049
279     CA_1     11619     3049
280     CA_1     11620     3049
281     CA_1     11621     3049
282     CA_2     11101     1035

[283 rows x 3 columns]

In [16]:
df_3 = pd.read_csv('../data/raw/calendar.csv', low_memory=False)

In [110]:
df_3.head()

         date  wm_yr_wk    d
0  2011-01-29     11101  d_1
1  2011-01-30     11101  d_2
2  2011-01-31     11101  d_3
3  2011-02-01     11101  d_4
4  2011-02-02     11101  d_5

In [109]:
unique_weekid_count = df_3['wm_yr_wk'].nunique()
print("Number of unique weeks:", unique_weekid_count)

Number of unique weeks: 282

In [17]:
df_4 = pd.read_csv('../data/raw/calendar_events.csv', low_memory=False)

In [131]:
df_4.head()

         date     event_name event_type
0  2011-02-06      SuperBowl   Sporting
1  2011-02-14  ValentinesDay   Cultural
2  2011-02-21  PresidentsDay   National
3  2011-03-09      LentStart  Religious
4  2011-03-16      LentWeek2  Religious

In [18]:
# Assuming df_1 contains your sales data and df_3 contains the date mapping
# Create a dictionary to map 'd_' labels to dates
date_mapping = dict(zip(df_3['d'], df_3['date']))

# Rename the 'd_' columns in df_1 with their respective dates
df_1.rename(columns=date_mapping, inplace=True)

# Now, the 'd_1', 'd_2', ... columns in df_1 will be renamed with their corresponding dates

In [19]:
df_1.head()

,id,item_id,dept_id,cat_id,store_id,state_id,2011-01-29,2011-01-30,2011-01-31,2011-02-01,...,2015-04-09,2015-04-10,2015-04-11,2015-04-12,2015-04-13,2015-04-14,2015-04-15,2015-04-16,2015-04-17,2015-04-18
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,1,1,1,0,1,0,1,0,0,1
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,0,0,0,0,0,0,1,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,0,0,1,0,0,0,0,0,0,0
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,8,2,0,8,2,3,1,1,3,8
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,0,0,0,0,...,2,0,1,3,2,1,1,2,2,3

In [20]:
long_format_sales = pd.melt(df_1, id_vars=['id', 'item_id', 'dept_id', 'cat_id', 'store_id', 'state_id'],
                            var_name='date', value_name='units_sold')

In [21]:
long_format_sales.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
dtype: int64

In [80]:
long_format_sales.head()

,id,item_id,dept_id,cat_id,store_id,state_id,date,units_sold
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0

In [81]:
unique_dates_count = long_format_sales['date'].nunique()
print("Number of unique dates:", unique_dates_count)

Number of unique dates: 1541

In [52]:
long_format_sales.head(30491)

,id,item_id,dept_id,cat_id,store_id,state_id,date,units_sold
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0
...,...,...,...,...,...,...,...,...
30486,FOODS_3_824_WI_3_evaluation,FOODS_3_824,FOODS_3,FOODS,WI_3,WI,2011-01-29,0
30487,FOODS_3_825_WI_3_evaluation,FOODS_3_825,FOODS_3,FOODS,WI_3,WI,2011-01-29,0
30488,FOODS_3_826_WI_3_evaluation,FOODS_3_826,FOODS_3,FOODS,WI_3,WI,2011-01-29,0
30489,FOODS_3_827_WI_3_evaluation,FOODS_3_827,FOODS_3,FOODS,WI_3,WI,2011-01-29,0
30490,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-30,0

In [22]:
# Define the path where you want to save the CSV file
save_path = '../data/processed/long_format.csv'

# Save the DataFrame as a CSV file
long_format_sales.to_csv(save_path, index=False)

In [23]:
import pandas as pd

# Create a DataFrame to map dates to weeks
date_to_week_mapping = df_3[['date', 'wm_yr_wk']]

# Merge the long-format sales data with the date-to-week mapping
combined_data = pd.merge(long_format_sales, date_to_week_mapping, on='date')



# Now, combined_data contains sales data for each product on each date

In [125]:
combined_data.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
wm_yr_wk      46985090
dtype: int64

In [126]:
combined_data.head()

,id,item_id,dept_id,cat_id,store_id,state_id,date,units_sold,wm_yr_wk
0,HOBBIES_1_001_CA_1_evaluation,HOBBIES_1_001,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0,11101
1,HOBBIES_1_002_CA_1_evaluation,HOBBIES_1_002,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0,11101
2,HOBBIES_1_003_CA_1_evaluation,HOBBIES_1_003,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0,11101
3,HOBBIES_1_004_CA_1_evaluation,HOBBIES_1_004,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0,11101
4,HOBBIES_1_005_CA_1_evaluation,HOBBIES_1_005,HOBBIES_1,HOBBIES,CA_1,CA,2011-01-29,0,11101

In [3]:
combined_data.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
wm_yr_wk      46985090
dtype: int64

In [24]:
import pandas as pd

# Perform a left join to merge the dataframes
combined_data = pd.merge(combined_data, df_2, on=['item_id', 'wm_yr_wk', 'store_id'], how='left')

# Calculate sales by multiplying sell_price with units_sold
combined_data['sales'] = combined_data['sell_price'] * combined_data['units_sold']

In [25]:
combined_data.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
wm_yr_wk      46985090
sell_price    34720691
sales         34720691
dtype: int64

In [95]:
ItemCount = combined_data['item_id'].nunique()
print("Number of unique items:", ItemCount)


StoreCount = combined_data['store_id'].nunique()
print("Number of unique stores:", StoreCount)

Number of unique items: 3049
Number of unique stores: 10

In [26]:
# Sort the DataFrame by "store_id," "date," and "item_id"
combined_data = combined_data.sort_values(by=['store_id', 'item_id'])

# Reset the index if needed
combined_data.reset_index(drop=True, inplace=True)

In [29]:
# Verify that the DataFrame has been sorted as desired
combined_data.head(100)

,id,item_id,dept_id,cat_id,store_id,state_id,date,units_sold,wm_yr_wk,sell_price,sales
0,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-01-29,3,11101,2.0,6.0
1,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-01-30,0,11101,2.0,0.0
2,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-01-31,0,11101,2.0,0.0
3,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-02-01,1,11101,2.0,2.0
4,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-02-02,4,11101,2.0,8.0
...,...,...,...,...,...,...,...,...,...,...,...
95,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-05-04,0,11114,2.0,0.0
96,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-05-05,0,11114,2.0,0.0
97,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-05-06,9,11114,2.0,18.0
98,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-05-07,0,11115,2.0,0.0
99,FOODS_1_001_CA_1_evaluation,FOODS_1_001,FOODS_1,FOODS,CA_1,CA,2011-05-08,0,11115,2.0,0.0

In [30]:
# Import the pandas library
import pandas as pd

# Forward fill missing values in the "sell_price" 
combined_data['sell_price'].fillna(method='ffill', inplace=True)

In [31]:
combined_data.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
wm_yr_wk      46985090
sell_price    46985090
sales         34720691
dtype: int64

In [32]:
combined_data['sales'] = combined_data['sell_price'] * combined_data['units_sold']

In [33]:
 combined_data.count()

id            46985090
item_id       46985090
dept_id       46985090
cat_id        46985090
store_id      46985090
state_id      46985090
date          46985090
units_sold    46985090
wm_yr_wk      46985090
sell_price    46985090
sales         46985090
dtype: int64

In [34]:
missing_values = combined_data[combined_data['sell_price'].isnull() | combined_data['sales'].isnull()]
missing_values

Empty DataFrame
Columns: [id, item_id, dept_id, cat_id, store_id, state_id, date, units_sold, wm_yr_wk, sell_price, sales]
Index: []

In [35]:
save_path = '../data/processed/final_merged.csv'

# Save the DataFrame as a CSV file
combined_data.to_csv(save_path, index=False)